tap "aws/tap"
tap "oven-sh/bun"
tap "romkatv/powerlevel10k"
tap "runpod/runpodctl"
tap "supabase/tap"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Library for command-line editing
brew "readline"
# General-purpose data compression with high compression ratio
brew "xz"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Plugin manager for zsh, inspired by oh-my-zsh and vundle
brew "antigen"
# CLI tool to build, test, debug, and deploy Serverless applications using AWS SAM
brew "aws-sam-cli"
# Official Amazon AWS command-line interface
brew "awscli"
# Get/set bluetooth power and discoverable state
brew "blueutil"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# GitHub command-line tool
brew "gh"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Client library for huggingface.co hub
brew "huggingface-cli"
# Handy way to save and run project-specific commands
brew "just"
# Mac App Store command-line interface
brew "mas"
# Fast, highly customisable system info script
brew "neofetch"
# Manage multiple Node.js versions
brew "nvm"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Fast, disk space efficient package manager
brew "pnpm"
# Object-relational database system
brew "postgresql@14"
# Theme for zsh
brew "powerlevel10k"
# Password generator
brew "pwgen"
# Cross-shell prompt for astronauts
brew "starship"
# Tool Command Language
brew "tcl-tk@8"
# Command-line interface for running and interacting with Temporal Server and UI
brew "temporal"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Executes a program periodically, showing output fullscreen
brew "watch"
# General-purpose lossless data-compression library
brew "zlib"
# Copilot CLI - build, release and operate your container apps on AWS
brew "aws/tap/copilot-cli"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
brew "runpod/runpodctl/runpodctl"
# Supabase CLI
brew "supabase/tap/supabase"
# Command-line interface for 1Password
cask "1password-cli"
# Prevents your sleeping computer from connecting to Bluetooth accessories
cask "bluesnooze"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Replacement for Docker Desktop
cask "orbstack"
# Administration and development platform for PostgreSQL
cask "pgadmin4"
# Plugin for AWS CLI to start and end sessions that connect to managed instances
cask "session-manager-plugin"
mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "Developer", id: 640199958
mas "OneDrive", id: 823766827
mas "Pages", id: 409201541
mas "Perplexity", id: 6714467650
mas "Seashore", id: 1448648921
mas "Session", id: 1521432881
mas "Slack", id: 803453959
mas "Telegram", id: 747648890
mas "TestFlight", id: 899247664
mas "Toggl Track", id: 1291898086
mas "WhatsApp", id: 310633997
mas "Windows App", id: 1295203466
mas "Xcode", id: 497799835
vscode "1yib.svelte-bundle"
vscode "aaron-bond.better-comments"
vscode "anysphere.pyright"
vscode "ardenivanov.svelte-intellisense"
vscode "augment.vscode-augment"
vscode "austenc.tailwind-docs"
vscode "batisteo.vscode-django"
vscode "bradlc.vscode-tailwindcss"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "chakrounanas.turbo-console-log"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "connor4312.esbuild-problem-matchers"
vscode "databricks.databricks"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dunstontc.vscode-google-sheets-syntax"
vscode "eamodio.gitlens"
vscode "fivethree.vscode-svelte-snippets"
vscode "formulahendry.auto-rename-tag"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gruntfuggly.todo-tree"
vscode "kevinrose.vsc-python-indent"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "moalamri.inline-fold"
vscode "ms-azuretools.azure-dev"
vscode "ms-azuretools.vscode-azureappservice"
vscode "ms-azuretools.vscode-azurecontainerapps"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azurestaticwebapps"
vscode "ms-azuretools.vscode-azurestorage"
vscode "ms-azuretools.vscode-azurevirtualmachines"
vscode "ms-azuretools.vscode-cosmosdb"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.extension-test-runner"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-node-azure-pack"
vscode "ms-vsliveshare.vsliveshare"
vscode "njpwerner.autodocstring"
vscode "openai.chatgpt"
vscode "p1c2u.docker-compose"
vscode "paiqo.databricks-vscode"
vscode "pkief.material-icon-theme"
vscode "postman.postman-for-vscode"
vscode "prisma.prisma"
vscode "randomfractalsinc.vscode-data-table"
vscode "redhat.vscode-yaml"
vscode "rooveterinaryinc.roo-cline"
vscode "saketsarin.composer-web"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "svelte.svelte-vscode"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "wholroyd.jinja"
vscode "wmaurer.change-case"
cask "1password"
cask "arc"
cask "betterdisplay"
cask "capcut"
cask "chatgpt"
cask "claude"
cask "cursor"
cask "dropbox"
cask "figma"
cask "flux"
cask "framer"
cask "google-chrome"
cask "google-drive"
cask "grammarly-desktop"
cask "granola"
cask "lm-studio"
cask "loom"
cask "nordvpn"
cask "notion-calendar"
cask "notion"
cask "obsidian"
cask "onedrive"
cask "postman-agent"
cask "raycast"
cask "session"
cask "slack"
cask "spotify"
cask "sublime-text"
cask "superwhisper"
cask "tableplus"
cask "telegram"
cask "visual-studio-code"
cask "vlc"
cask "webcatalog"
cask "windsurf"
cask "zed"
